# Concatenación de data frames

Para dataframe, existen 3 formas de concatenar:
- concat
- merge
- join

## Concat

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':['1A', '2A'],'B':['1B', '2B'],'C':['1C', '2C']})
df2 = pd.DataFrame({'A':['6A', '7A', '8A'],'B':['6B', '7B', '8B'],'C':['6C', '7C', '8C']})

In [3]:
df1

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [4]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [6]:
pd.concat([df1,df2], ignore_index = False)

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [7]:
pd.concat([df1,df2], ignore_index = True) #Si los df concateandos no tienen la mismas columnas la nueva simplemente se agrega

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

## Merge fusionar

Fuisiona diferentes dataframes a partir de una columna (llave) en común.
No pude unir columnas que se llamen igual

In [14]:
df1 = pd.DataFrame({'A':['1A', '2A'],'B':['1B', '2B']})
df2 = pd.DataFrame({'A':['3A', '4A'],'C':['1C', '2C'],'K':['1K', '2K']})

In [15]:
pd.merge(df1,df2, on=['A'] ) #on = a la columna que va a fusionar(poner los elementos que sean iguales en ambos dataframes). 
#Si no hay nada en común no pone nada

Empty DataFrame
Columns: [A, B, C, K]
Index: []

In [16]:
pd.merge(df1,df2, on=['A'], how = 'outer')

    A    B    C    K
0  1A   1B  NaN  NaN
1  2A   2B  NaN  NaN
2  3A  NaN   1C   1K
3  4A  NaN   2C   2K

In [17]:
pd.merge(df1,df2, on=['A'], how = 'left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN

In [18]:
pd.merge(df1,df2, on=['A'], how = 'right')

    A    B   C   K
0  3A  NaN  1C  1K
1  4A  NaN  2C  2K

# Join

La idea de este dataframe es combinar las columnas de dos dataframes indexados

In [19]:
df1 = pd.DataFrame({'Z':['1Z', '2Z'],'B':['1B', '2B']})
df2 = pd.DataFrame({'A':['3A', '4A'],'C':['1C', '2C'],'K':['1K', '2K']})

In [20]:
df1.join(df2)

    Z   B   A   C   K
0  1Z  1B  3A  1C  1K
1  2Z  2B  4A  2C  2K

# Entradas y salidas

In [21]:
df3 = df1.join(df2)

In [22]:
df3.to_csv('nombre.csv') # index = false no pone los indices

In [23]:
pd.read_csv('nombre.csv')

   Unnamed: 0   Z   B   A   C   K
0           0  1Z  1B  3A  1C  1K
1           1  2Z  2B  4A  2C  2K